Documents/ЗаявкаНаОбеспечение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОбеспечение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаОбеспечение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспечиваетсяЗакупкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Протокол</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявокНаОбеспечение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаявокНаОбеспечение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаОбеспечение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаОбеспечение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	ИнициализироватьДокумент();
	Товары.Добавить(); // Чтобы была возможность редактирования в упрощенном интерфейсе.
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();
	Протокол.Очистить();
	Статус = Перечисления.СтатусыЗаявокНаОбеспечение.Черновик;
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
		
	ОднаПозиция = Ложь; // Для программной обработки считаем, что всегда таблица, чтобы была привязка к объекту.
	Если ДополнительныеСвойства.Свойство("ОднаПозиция") Тогда
		ОднаПозиция = ДополнительныеСвойства.ОднаПозиция;
	КонецЕсли;
	
	ИспользоватьЛимитыБДР = Ложь; // Значение по умолчанию для УТ.
			
	
	ЗаявкаСогласована = Перечисления.СтатусыЗаявокНаОбеспечение.Согласована(Статус);
	
	ИменаРеквизитовЗакупки = Документы.ЗаявкаНаОбеспечение.ИменаРеквизитовЗакупки();
	ИменаРеквизитовАналитикЛимитирования = Документы.ЗаявкаНаОбеспечение.ИменаРеквизитовАналитикЛимитирования();
	ИменаРеквизитовРучнойПроверки = Новый Массив;
	
	Если ИспользоватьЛимитыБДР И ЗаявкаСогласована Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИменаРеквизитовРучнойПроверки, ИменаРеквизитовАналитикЛимитирования);
	Иначе
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НепроверяемыеРеквизиты, ИменаРеквизитовАналитикЛимитирования);
	КонецЕсли;
	
	Если Документы.ЗаявкаНаОбеспечение.ПроверятьРеквизитыЗакупки(ЭтотОбъект) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИменаРеквизитовРучнойПроверки, ИменаРеквизитовЗакупки);
	Иначе
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НепроверяемыеРеквизиты, ИменаРеквизитовЗакупки);
	КонецЕсли;
	
	Если ОднаПозиция Тогда
		
		ИменаРеквизитовРучнойПроверки.Добавить("Товары.НоменклатураСтрокой");
		
		ПроверитьЗаполнениеРеквизитовЕдинственнойПозиции(
			ИменаРеквизитовРучнойПроверки,
			ПредставленияРеквизитовТоваров(),
			НепроверяемыеРеквизиты,
			Отказ);
		
	КонецЕсли;
	
	Если Не ЗаявкаСогласована Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НепроверяемыеРеквизиты, Документы.ЗаявкаНаОбеспечение.ИменаРеквизитовШапки());
	КонецЕсли;
	
	ПараметрыПроверкиЗаполненияКоличества = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверкиЗаполненияКоличества.ЭтоПроверкаТекущейСтроки = ОднаПозиция;
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(
		ЭтотОбъект,
		ПроверяемыеРеквизиты,
		Отказ,
		ПараметрыПроверкиЗаполненияКоличества);
	
	ПараметрыПроверкиЗаполненияХарактеристик = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
	ПараметрыПроверкиЗаполненияХарактеристик.ЭтоПроверкаТекущейСтроки = ОднаПозиция;
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(
		ЭтотОбъект,
		НепроверяемыеРеквизиты,
		Отказ,
		ПараметрыПроверкиЗаполненияХарактеристик);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаявкаНаОбеспечение.ПараметрыВыбораСтатейИАналитик(ОбеспечиваетсяЗакупкой);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	УстанавливаемыйРежимЗаписи = Документы.ЗаявкаНаОбеспечение.РежимЗаписи(ЭтотОбъект);
	Если УстанавливаемыйРежимЗаписи = РежимЗаписиДокумента.Проведение
		И УстанавливаемыйРежимЗаписи <> РежимЗаписи
		И Не ДополнительныеСвойства.Свойство("ПропуститьПроверкуЗаполнения") 
		И Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	РежимЗаписи = УстанавливаемыйРежимЗаписи;
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);
	РаботаСПротоколомДокумента.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	ОчиститьРеквизитыЗакупки();
	
	СуммаДокумента = Товары.Итог("Сумма");
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Исполнитель = Автор;
	КонецЕсли;
	
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, Подразделение);
	Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	
	ОтображатьРеквизитыЗакупки = Документы.ЗаявкаНаОбеспечение.ОтображатьРеквизитыЗакупки(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Валюта)
		И ОтображатьРеквизитыЗакупки Тогда
		Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Валюта)
		И ОтображатьРеквизитыЗакупки Тогда
		// Повторная попытка заполнения валюты, в случае, если организация не заполнена.
		Валюта = ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеЗакупкой

Процедура ОчиститьРеквизитыЗакупки()
	
	Если Документы.ЗаявкаНаОбеспечение.ОтображатьРеквизитыЗакупки(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеШапки = Новый Структура;
	ДанныеСтроки = Новый Структура;
	
	Для Каждого ИсходноеИмяРеквизита Из Документы.ЗаявкаНаОбеспечение.ИменаРеквизитовЗакупки() Цикл
		
		ИмяРеквизита = СтрЗаменить(ИсходноеИмяРеквизита, "Товары.", "");
		
		Если ИмяРеквизита = ИсходноеИмяРеквизита Тогда
			ДанныеШапки.Вставить(ИмяРеквизита);
		Иначе
			ДанныеСтроки.Вставить(ИмяРеквизита);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеШапки);
	Для Каждого СтрокаТовара Из Товары Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТовара, ДанныеСтроки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОднаПозиция

Функция ПредставленияРеквизитовТоваров()
	
	ВозвращаемоеЗначение = Новый Структура;
	
	Реквизиты = Ссылка.Метаданные().ТабличныеЧасти.Товары.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		
		ПредставлениеРеквизита = Реквизит.Представление();
		ВозвращаемоеЗначение.Вставить(Реквизит.Имя, ПредставлениеРеквизита);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитовЕдинственнойПозиции(ИменаРеквизитов, ПредставленияРеквизитов, НепроверяемыеРеквизиты, Отказ)
	
	ПрефиксТоваров = "Товары.";
	СтрокаТоваров = Товары[0]; // Проверка наличия строки до вызова
	Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
		
		ИмяРеквизитаТаблицы = СтрЗаменить(ИмяРеквизита, ПрефиксТоваров, "");
		
		Если ИмяРеквизитаТаблицы = ИмяРеквизита Тогда
			Продолжить;
		КонецЕсли;
		
		НепроверяемыеРеквизиты.Добавить(ИмяРеквизита);
		
		Если Не ЗначениеЗаполнено(СтрокаТоваров[ИмяРеквизитаТаблицы]) Тогда
			
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле",
				"Заполнение",
				ПредставленияРеквизитов[ИмяРеквизитаТаблицы]);
				
			ПутьКЭлементу = ОбщегоНазначенияУТКлиентСервер.ПутьКЭлементуТекущейСтрокиТаблицыФормы(
				"Товары",
				ИмяРеквизитаТаблицы);
				
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				,// При выводе ошибки в "элемент" нельзя указать объект.
				ПутьКЭлементу,,
				Отказ);
				
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#КонецЕсли
